it/src/Documents/ПоступлениеОС/ПоступлениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеОС</name>
  <registerRecords>AccumulationRegister.РазмещениеОбъектов</registerRecords>
  <registerRecords>InformationRegister.ПоддержкаЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОС</registerRecords>
  <registerRecords>InformationRegister.ОтключенныеКомпьютеры</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговораКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОСВладелец</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяДомена</name>
      <type>
        <types>CatalogRef.ИдентификаторыДоменов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Enums/ВидОсновногоСредства/ВидОсновногоСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОсновногоСредства</name>
  <enumValues>
    <name>ПерсональныйКомпьютер</name>
  </enumValues>
  <enumValues>
    <name>ПрограммноеОбеспечение</name>
  </enumValues>
  <enumValues>
    <name>Лицензия</name>
  </enumValues>
  <enumValues>
    <name>Железо</name>
  </enumValues>
</mdclass:Enum>

it/src/Catalogs/ОсновныеСредства/ОсновныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеСредства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОсновногоСредства</name>
    <type>
      <types>CatalogRef.ВидыОсновногоСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

it/src/Catalogs/ВидыОсновногоСредства/ВидыОсновногоСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОсновногоСредства</name>
  <predefined>
    <items>
      <name>Железо</name>
      <description>Железо</description>
    </items>
    <items>
      <name>Лицензия</name>
      <description>Лицензия</description>
    </items>
    <items>
      <name>ПерсональныйКомпьютер</name>
      <description>Персональный компьютер</description>
    </items>
    <items>
      <name>ПрограммноеОбеспечение</name>
      <description>Программное обеспечение</description>
    </items>
    <items>
      <name>ПродлениеПоддержкиПО</name>
      <description>Продление поддержки ПО</description>
    </items>
  </predefined>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
</mdclass:Catalog>

it/src/Documents/ПоступлениеОС/ManagerModule.bsl
// Получить таблицу .
//
Функция ПолучитьТаблицуМестонахождениеОС(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеОССведенияОС.Ссылка КАК Регистратор,
	               |	ПоступлениеОССведенияОС.Ссылка.Дата КАК Период,
	               |	ПоступлениеОССведенияОС.ОсновноеСредство,
	               |	ПоступлениеОССведенияОС.Ссылка.Организация КАК Организация,
	               |	ПоступлениеОССведенияОС.ПодразделениеОрганизации,
	               |	ПоступлениеОССведенияОС.МОЛ КАК МОЛ,
	               |	ПоступлениеОССведенияОС.Помещение КАК Помещение,
	               |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка) КАК ОСВладелец,
	               |	ПоступлениеОССведенияОС.ИмяДомена
	               |ИЗ
	               |	Документ.ПоступлениеОС.СведенияОС КАК ПоступлениеОССведенияОС
	               |ГДЕ
	               |	ПоступлениеОССведенияОС.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()

 //Комиссаров: 29/07/2013
 Функция ПолучитьТаблицуЗакупки(ДополнительныеСвойства) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ДокументПоступления.Ссылка.Организация,
	                |	ДокументПоступления.ОсновноеСредство.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	                |	ДокументПоступления.ОсновноеСредство КАК Лицензия,
	                |	ДокументПоступления.Количество КАК Количество,
	                |	ДокументПоступления.Стоимость,
	                |	ДокументПоступления.Ссылка.Дата КАК Период,
	                |	ДокументПоступления.Ссылка КАК Регистратор,
	                |	ДокументПоступления.НомерСтроки,
	                |	ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства КАК ВидОсновногоСредства
	                |ИЗ
	                |	Документ.ПоступлениеОС.ОсновныеСредства КАК ДокументПоступления
	                |ГДЕ
	                |	ДокументПоступления.Ссылка = &Ссылка
	                |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &Лицензия";
					
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("Лицензия", Справочники.ВидыОсновногоСредства.Лицензия); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции //ПолучитьТаблицуЗакупкиЛицензий	

Функция ПолучитьТаблицуЛицензииОрганизации(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументПоступления.Ссылка.Организация,
	               |	ДокументПоступления.ОсновноеСредство.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |	ДокументПоступления.ОсновноеСредство КАК Лицензия,
	               |	ДокументПоступления.Количество,
	               |	ДокументПоступления.Ссылка.Дата КАК Период,
	               |	ДокументПоступления.Ссылка КАК Регистратор,
	               |	ДокументПоступления.НомерСтроки,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	               |ИЗ
	               |	Документ.ПоступлениеОС.ОсновныеСредства КАК ДокументПоступления
	               |ГДЕ
	               |	ДокументПоступления.Ссылка = &Ссылка
	               |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &ВидОсновногоСредства";
				   
				   
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("ВидОсновногоСредства", Справочники.ВидыОсновногоСредства.Лицензия);	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ПолучитьТаблицуЛицензииОрганизации

Функция ПолучитьТаблицуРазмещениеОбъектов(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументПоступления.Ссылка.Организация,
	               |	ДокументПоступления.ОсновноеСредство.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |	ДокументПоступления.ОсновноеСредство КАК Лицензия,
	               |	ДокументПоступления.Количество,
	               |	ДокументПоступления.Ссылка.Дата КАК Период,
	               |	ДокументПоступления.Ссылка КАК Регистратор,
	               |	ДокументПоступления.НомерСтроки,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	               |ИЗ
	               |	Документ.ПоступлениеОС.ОсновныеСредства КАК ДокументПоступления
	               |ГДЕ
	               |	ДокументПоступления.Ссылка = &Ссылка
	               |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &ВидОсновногоСредства";
				   
				   
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("ВидОсновногоСредства", Перечисления.ВидОсновногоСредства.ПрограммноеОбеспечение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ПолучитьТаблицуРазмещениеОбъектов	
//Комиссаров

// Функция находит документ поступления для заданного основного средства.
//
// Параметры:
//	ОсновноеСредство - Основное средство, для которого необходимо найти счет-фактуру
//
// Возвращаемые параметры:
//	РеквизитыДокументаПоступления - Структура - Номер и дата документа поступления
//
// Возвращаемое значение:
//	ДокументСсылка.ПоступлениеОС - Найденный документ
//
Функция ДокументПоступления(ОсновноеСредство, РеквизитыДокументаПоступления = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДанныеДокумента.Ссылка КАК ДокументПоступления,
	               |	ДанныеДокумента.Ссылка.Номер,
	               |	ДанныеДокумента.Ссылка.Дата,
	               |	ДанныеДокумента.Ссылка.Организация
	               |ИЗ
	               |	Документ.ПоступлениеОС.ОсновныеСредства КАК ДанныеДокумента
	               |ГДЕ
	               |	ДанныеДокумента.ОсновноеСредство = &ОсновноеСредство
	               |	И НЕ ДанныеДокумента.Ссылка.ПометкаУдаления";
	
	
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	
	ДокументПоступления = Документы.ПоступлениеОС.ПустаяСсылка();
	РеквизитыДокументаПоступления = Новый Структура("Номер, Дата, Организация");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументПоступления = Выборка.ДокументПоступления;
		ЗаполнитьЗначенияСвойств(РеквизитыДокументаПоступления, Выборка);
	КонецЕсли;
	
	Возврат ДокументПоступления;
	
КонецФункции // СчетФактураДокумента()
